stirredTankReactor/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }
    vessel
    {
        type            zeroGradient;
    }

    impeller
    {
        type            zeroGradient;
    }

        
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
